app/Controllers/Home.php

    public function index()
    {
        $noticias_model = new noticias_Model();
        $data ['noticias']=$noticias_model->where ('noticia_estado', 1)->findAll();
---
SELECT *
FROM `noticias`
WHERE `noticia_estado` = 1