app/Controllers/noticias_Controller.php

    public function ver_noticia($id_noticia)
{
    $noticias_model = new noticias_Model();
    $noticia = $noticias_model->find($id_noticia);
---
SELECT *
FROM `noticias`
WHERE `noticias`.`id_noticia` = '23'